backend/controllers/BookingController.php

    public function actionIndex()
    {

        $searchModel = new BookingHeaderSearch();

        $searchModel->order_status='Open';
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
        $dataProvider->pagination=false;
        $date=date('m-Y');


$booking_header_summmary=BookingHeader::find()->select(['sum(net_value) as total_rent','sum((paid_amount-net_value-refunded)) as total_pending','count(*) as number_invoice','sum(paid_amount) total_paid','sum(deposite_amount) total_deposite_amount','sum(net_value) total_net_value','sum(extra_amount) total_extra_amount'])->where(['order_status'=>array('Open')])->createCommand()->queryOne();
---
SELECT sum(net_value) AS `total_rent`, sum((paid_amount-net_value-refunded)) AS `total_pending`, count(*) AS `number_invoice`, sum(paid_amount) AS `total_paid`, sum(deposite_amount) AS `total_deposite_amount`, sum(net_value) AS `total_net_value`, sum(extra_amount) AS `total_extra_amount` FROM `booking_header` WHERE `order_status`='Open'

    public function checkBooking($product_id,$pickup_date,$return_date,$booking_id=null){
        $where_booking=($booking_id==null)?1:['!=','booking_id',$booking_id];
        $booking_items=BookingItem::find()->select(['item_id','booking_id','product_id','item_no','pickup_date','return_date' ])->where(['product_id'=>$product_id ])->andWhere("`pickup_date` <= '$return_date' and `return_date` >= '$pickup_date'")->andWhere(['item_status'=>['Booked','Picked']])->andWhere($where_booking)->asArray()->all();
---
SELECT `item_id`, `booking_id`, `product_id`, `item_no`, `pickup_date`, `return_date` FROM `booking_item` WHERE (`product_id`='239') AND (`pickup_date` <= '2021-12-08' and `return_date` >= '2021-11-15') AND (`item_status` IN ('Booked', 'Picked')) AND (`booking_id` != 1089)

    public function actionIndexSales()
    {
        //$date=date('m-Y');
        $date=(isset($_GET['month'])&&isset($_GET['year']))?$_GET['month'].'-'.$_GET['year']:date('m-Y');
        $searchModel = new BookingHeaderSearch();
        $searchModel->order_status=array('Open','Closed','Cancelled');
        $searchModel->month_year_filter=$date;
        $dataProvider = $searchModel->search_category(Yii::$app->request->queryParams);
        $dataProvider->pagination=false;

     $booking_header_summmary=BookingHeader::find()->select(['sum(earning_amount) as total_rent','sum((paid_amount-net_value -refunded)) as total_pending','count(*) as number_invoice','sum(paid_amount) total_paid','sum(deposite_amount) total_deposite_amount','sum(net_value) total_net_value','sum(extra_amount) total_extra_amount'])->where(['order_status'=>array('Open','Closed','Cancelled')])->andWhere('DATE_FORMAT(pickup_date, "%m-%Y") = "'. $date.'"')->createCommand()->queryOne();
---
SELECT sum(earning_amount) AS `total_rent`, sum((paid_amount-net_value -refunded)) AS `total_pending`, count(*) AS `number_invoice`, sum(paid_amount) AS `total_paid`, sum(deposite_amount) AS `total_deposite_amount`, sum(net_value) AS `total_net_value`, sum(extra_amount) AS `total_extra_amount` FROM `booking_header` WHERE (`order_status` IN ('Open', 'Closed', 'Cancelled')) AND (DATE_FORMAT(pickup_date, "%m-%Y") = "12-2021")

    public function actionIndexPayment()
    {
        $searchModel = new BookingHeaderSearch();
        $searchModel->payment_status=0;
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
      $date=date('m-Y');
$booking_header_summmary=BookingHeader::find()->select(['sum(net_value) as total_rent','sum((paid_amount-net_value -refunded)) as total_pending','count(*) as number_invoice','sum(paid_amount) total_paid','sum(deposite_amount) total_deposite_amount','sum(net_value) total_net_value','sum(extra_amount) total_extra_amount'])->where(['order_status'=>array('Open','Closed','Cancelled')])->andWhere('DATE_FORMAT(pickup_date, "%m-%Y") = "'. $date.'"')->createCommand()->queryOne();
---
SELECT sum(net_value) AS `total_rent`, sum((paid_amount-net_value -refunded)) AS `total_pending`, count(*) AS `number_invoice`, sum(paid_amount) AS `total_paid`, sum(deposite_amount) AS `total_deposite_amount`, sum(net_value) AS `total_net_value`, sum(extra_amount) AS `total_extra_amount` FROM `booking_header` WHERE (`order_status` IN ('Open', 'Closed', 'Cancelled')) AND (DATE_FORMAT(pickup_date, "%m-%Y") = "12-2021")

     public function updateSummary($pickup_date)
     {
        //echo $month;die;
      $time=strtotime($pickup_date);
         $month=date("m",$time);
         $year=date("Y",$time);
         $booking_header=BookingHeader::find()->select(['sum(rent_amount) as total_rent','sum((paid_amount-rent_amount -refunded)) as total_pending','count(*) as number_invoice'])->where(['order_status'=>array('Open','Closed','Cancelled')])->andWhere('DATE_FORMAT(pickup_date, "%m-%Y") = "'.$month.'-'.$year.'"')->andWhere(['IS NOT','pickup_date',null])->groupBy(["DATE_FORMAT(pickup_date,'%m-%Y')"])->createCommand()->queryOne();
         //print_r($booking_header);die;
         if($booking_header!=null){
         $booking_summary=BookingSummary::find()->where(['month'=>$month,'year'=>$year])->one();
         if($booking_summary!=""){
            $booking_summary->amount=$booking_header['total_rent'];
            $booking_summary->number_invoice=$booking_header['number_invoice'];
             $booking_summary->pending_amount=($booking_header['total_pending'])*-1;
         }else{
            $booking_summary=new  BookingSummary();
             $booking_summary->amount=$booking_header['total_rent'];
             $booking_summary->number_invoice=$booking_header['number_invoice'];
             $booking_summary->pending_amount=($booking_header['total_pending'])*-1;
              $booking_summary->month=$month;
             $booking_summary->year=$year;
         }
         $flag=$booking_summary->save();
---
SELECT sum(rent_amount) AS `total_rent`, sum((paid_amount-rent_amount -refunded)) AS `total_pending`, count(*) AS `number_invoice` FROM `booking_header` WHERE (`order_status` IN ('Open', 'Closed', 'Cancelled')) AND (DATE_FORMAT(pickup_date, "%m-%Y") = "11-2021") AND (`pickup_date` IS NOT NULL) GROUP BY DATE_FORMAT(pickup_date,'%m-%Y')
SELECT * FROM `booking_summary` WHERE (`month`='11') AND (`year`='2021')
UPDATE `booking_summary` SET `pending_amount`=12500, `amount`='241900', `number_invoice`=62 WHERE (`month`=11) AND (`year`=2021)

    public function updateItemSummary($pickup_date)
     {
        //echo $month;die;
      $time=strtotime($pickup_date);
         $month=date("m",$time);
         $year=date("Y",$time);
         $booking_items=BookingItem::find()->select(['sum(amount) as total_rent','count(*) as number_of_time_rented','item_category','item_type'])->where(['item_status'=>array('Booked','Picked','Returned')])->andWhere('DATE_FORMAT(pickup_date, "%m-%Y") = "'.$month.'-'.$year.'"')->groupBy(["item_category","item_type","DATE_FORMAT(pickup_date,'%m-%Y')"])->createCommand()->queryAll();
         $flag=true;
            ItemSummary::deleteAll(['month'=>$month,'year'=>$year]);
         foreach($booking_items as $booking_item){
          $item_summary=ItemSummary::find()->where(['month'=>$month,'year'=>$year,'item_type'=>$booking_item['item_type'],'item_category'=>$booking_item['item_category']])->one();
         if($item_summary!=""){
             $item_summary->rent_amount=$booking_item['total_rent'];

             $item_summary->number_of_time_rented=($booking_item['number_of_time_rented']);
         }else{
            $item_summary=new  ItemSummary();
             $item_summary->item_type=$booking_item['item_type'];
             $item_summary->item_category=$booking_item['item_category'];
             $item_summary->rent_amount=$booking_item['total_rent'];

             $item_summary->number_of_time_rented=($booking_item['number_of_time_rented']);
              $item_summary->month=$month;
             $item_summary->year=$year;
         }
           if(!$flag=$item_summary->save()){
---
SELECT sum(amount) AS `total_rent`, count(*) AS `number_of_time_rented`, `item_category`, `item_type` FROM `booking_item` WHERE (`item_status` IN ('Booked', 'Picked', 'Returned')) AND (DATE_FORMAT(pickup_date, "%m-%Y") = "11-2021") GROUP BY `item_category`, `item_type`, DATE_FORMAT(pickup_date,'%m-%Y')
DELETE FROM `item_summary` WHERE (`month`='11') AND (`year`='2021')
SELECT EXISTS(SELECT * FROM `item_summary` WHERE (`item_summary`.`month`='11') AND (`item_summary`.`year`='2021') AND (`item_summary`.`item_type`='9') AND (`item_summary`.`item_category`='1'))
SELECT * FROM `item_summary` WHERE (`month`='11') AND (`year`='2021') AND (`item_type`='9') AND (`item_category`='1')
INSERT INTO `item_summary` (`item_type`, `item_category`, `rent_amount`, `number_of_time_rented`, `month`, `year`) VALUES (9, 1, '5500.00', 2, 11, 2021)

        if($no_payment){
            foreach ($payment_models as $key => $payment_item) {
                if($payment_item->payment_id!=""){
                    $payment_retr=PaymentMaster::find()->where(['payment_id'=>$payment_item->payment_id])->one();
---
SELECT * FROM `payment_master` WHERE `payment_id`='2067'

        // $booking_items=BookingItem::find()->where(['item_id'=>$selected_items])->all();
        // print_r($selected_items);die;
        if($status!='Picked') {
            BookingItem::updateAll(['return_date' => $this->dateFormat($pickup_date), 'item_status' => $status], ['item_id' => $selected_items, 'booking_id' => $booking_id]);
        }else{
            BookingItem::updateAll(['pickup_date' => $this->dateFormat($pickup_date), 'item_status' => $status], ['item_id' => $selected_items, 'booking_id' => $booking_id]);
---
UPDATE `booking_item` SET `return_date`='2021-12-08', `item_status`='Returned' WHERE (`item_id` IN ('1778', '1779')) AND (`booking_id`='1089')
UPDATE `booking_item` SET `pickup_date`='2021-12-16', `item_status`='Picked' WHERE (`item_id` IN ('1827', '1828')) AND (`booking_id`='1113')

        $model->other_charges=$other_charges;
        $model->pending_amount=$pending_amount;
        if($status!='Picked'){
          $booking_items=BookingItem::find()->where(['booking_id'=>$booking_id])->andWhere(['!=','item_status','Returned'])->all();
---
SELECT * FROM `booking_item` WHERE (`booking_id`='1089') AND (`item_status` != 'Returned')


          }
        }else{
            $booking_items=BookingItem::find()->where(['booking_id'=>$booking_id])->andWhere(['!=','item_status','Picked'])->all();
---
SELECT * FROM `booking_item` WHERE (`booking_id`='1113') AND (`item_status` != 'Picked')

    public function CustomerSave($customer='',$created_on='')
    {
        $customer_old=null;
       if($customer->id!=''){
        $customer_old=CustomerMaster::find()->where(['id'=>$customer->id,'status'=>0])->one();
---
SELECT * FROM `customer_master` WHERE (`id`='986') AND (`status`=0)

    public function actionUpdate($id)
    {
       //$this->getattachmentPath("Test");
        $model = $this->findModel($id);
        //$this->sendInvoice($model);die;
        //print_r($_POST);die;
        $address_grup=ArrayHelper::map(AddressGroup::find()->all(),'id','name');
        $booking_items=$model->bookingItems;
        $customer_model=$model->customer;
        $payment_models=$model->payment;
        $old_pick_up=$model->pickup_date;
        $model->cancel_flag=($model->order_status=="Cancelled")?1:0;
        $model->picked_up=($model->status=='Picked')?1:0;
        if($payment_models==null){
            $payment_models=[new PaymentMaster()];
        }
        if ($model->load(Yii::$app->request->post())) {
---
SELECT * FROM `address_group`
SELECT * FROM `booking_item` WHERE `booking_id`=1089


                }
                  /*$summary=$this->bookingSummary($booking_item,$model->pickup_date);
                   if(!$flag=$summary->save()){
---
UPDATE `booking_item` SET `booking_id`=1089, `item_no`=10, `product_id`=239, `net_value`='5000.00', `item_category`=2, `item_type`=1, `amount`='2500.00', `earning_amount`='2500', `deposit_amount`='2500.00', `deposite_charge_status`=0, `extra_per`=NULL, `pickup_date`='2021-11-15', `return_date`='2021-12-08', `item_status`='Returned', `note`='', `discount`=NULL WHERE `item_id`='1778'

                   if($no_payment){
                    foreach ($payment_models as $key => $payment_item) {
                        if($payment_item->payment_id!=""){
                         $payment_retr=PaymentMaster::find()->where(['payment_id'=>$payment_item->payment_id])->one();
---
SELECT * FROM `payment_master` WHERE `payment_id`='1999'

    protected function findModel($id)
    {
        if (($model = BookingHeader::findOne($id)) !== null) {
---
SELECT * FROM `booking_header` WHERE `booking_id`='1089'