backend/controllers/BookingController.php

            $booking_items = DynamicFormsBookingItems::createMultiple(BookingItem::classname());
            DynamicFormsBookingItems::loadMultiple($booking_items, Yii::$app->request->post());
            array_shift($booking_items);
            $payment_models = DynamicFormsPaymentItems::createMultiple(PaymentMaster::classname());
---
INSERT INTO `payment_master` (`date`, `payment_id`, `booking_id`, `remark`, `type`, `mode_of_payment`, `received_by`, `sendto`, `received_during`, `amount`) VALUES ('2021-12-28', NULL, 980, '', 'Return-Deposit', 'Cash', 'Varsha', 'Company', 'Booking', 3500)