backend/controllers/BookingController.php

SELECT * FROM `customer_master` WHERE `id`=1099
---
  public function CustomerSave($customer = '', $created_on = '')
  {
    $customer_old = null;
    if ($customer->id != '') {
      $customer_old = CustomerMaster::find()->where(['id' => $customer->id, 'status' => 0])->one();