backend/controllers/ItemController.php

SELECT * FROM `type_master`
SELECT * FROM `category_master`
SELECT `type_id`, count(*) AS `total_items` FROM `item_master` WHERE (`scrab_status`='No') AND (`delete_status`=0) GROUP BY `type_id` ORDER BY `total_items` DESC LIMIT 10
---
    public function actionIndex()
    {
        $type_master = ArrayHelper::map(TypeMaster::find()->all(),'id','name');
        $model_category = ArrayHelper::map(CategoryMaster::find()->all(),'id','name');
        $searchModel = new ItemMasterSearch();
        $searchModel->delete_status=0;
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
       // $dataProvider->pagination=false;
        $item_summary=ItemMaster::find()->select(['type_id','count(*) total_items'])->where(['scrab_status'=>'No','delete_status'=>0])->groupBy('type_id')->orderBy(['total_items'=>SORT_DESC])->limit(10)->asArray()->all();

SELECT * FROM `category_master`
SELECT * FROM `vendor_master`
SELECT * FROM `color_master`
---
    public function actionCreate()
    {
        $model = new ItemMaster();
        $model_category = ArrayHelper::map(CategoryMaster::find()->all(),'id','name');
       // $model_type= ArrayHelper::map(TypeMaster::find()->all(),'id','name');

        $model_vendor=ArrayHelper::map(VendorMaster::find()->all(),'id','name');
        $color_model=ArrayHelper::map(ColorMaster::find()->all(),'id','name');

SELECT * FROM `category_master`
SELECT * FROM `color_master`
SELECT EXISTS(SELECT * FROM `type_master` WHERE `type_master`.`id`='9')
SELECT * FROM `vendor_master`
---
    public function actionUpdate($id)
    {
        $model = $this->findModel($id);
        $model_category = ArrayHelper::map(CategoryMaster::find()->all(),'id','name');
       // $model_type= ArrayHelper::map(TypeMaster::find()->all(),'id','name');
      $color_model=ArrayHelper::map(ColorMaster::find()->all(),'id','name');
        $model_vendor=ArrayHelper::map(VendorMaster::find()->all(),'id','name');

SELECT `id`, `name` FROM `type_master` WHERE `category_id`='1'
---
    public function actionGetType(){
        $out = [];
//print_r($_POST);die;
        if (isset($_POST['depdrop_parents'])) {
            $parents = $_POST['depdrop_parents'];
            if ($parents != null) {
                $cat_id = $parents[0];

                $out = TypeMaster::find()->select(['id','name'])->where(['category_id'=>$cat_id])->all();

SELECT * FROM `item_master` WHERE `id`='434'
---
    protected function findModel($id)
    {
        if (($model = ItemMaster::findOne($id)) !== null) {