backend/controllers/ItemController.php

    public function actionCreate()
    {
      /*ALTER TABLE `item_master` CHANGE `purchase_amount` `purchase_amount` DECIMAL(10,2) NULL DEFAULT 1;*/
         //print_r($_POST['ItemMaster']['occcasion_master']);die;
        $user = Yii::$app->user->identity;
        $is_admin = ($user->user_type == "admin") ? true : false;
        $model = new ItemMaster();
        $img_list = [new ItemMasterImg()];
        $model_category = ArrayHelper::map(CategoryMaster::find()->all(), 'id', 'name');
---
SELECT EXISTS(SELECT * FROM `category_master` WHERE `category_master`.`id`='1')

    public function actionCreatePopup()
    {
        $model = new ItemMaster();
        $model_category = ArrayHelper::map(CategoryMaster::find()->all(), 'id', 'name');
---
SELECT * FROM `item_master` WHERE `id`='434'