backend/controllers/ItemController.php

SELECT `id`, `name` FROM `type_master` WHERE `category_id`='1'
---
    public function actionCreatePopup()
    {
        $model = new ItemMaster();
        $model_category = ArrayHelper::map(CategoryMaster::find()->all(), 'id', 'name');