backend/controllers/PaymentController.php

SELECT sum(amount) AS `total`, `mode_of_payment` FROM `payment_master` WHERE DATE_FORMAT(date, "%m-%Y") = "12-2021" GROUP BY `mode_of_payment`
---
    public function actionIndex()
    {
         $date=(isset($_GET['month'])&&isset($_GET['year']))?$_GET['month'].'-'.$_GET['year']:date('m-Y');
        $searchModel = new PaymentMasterSearch();
         $searchModel->month_year_filter=$date;
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);

       // $date=date('m-Y');
        $payment_summarys = PaymentMaster::find()->select(['sum(amount) as total','mode_of_payment'])->where('DATE_FORMAT(date, "%m-%Y") = "'. $date.'"')->groupby(['mode_of_payment'])->createCommand()->queryAll();

SELECT * FROM `customer_master`
---
public function actionPaymentSearch()
 {

    $model = new PaymentMasterSearch();
    $customer_master=(ArrayHelper::map(CustomerMaster::find()->all(), 'id', 'name'));