backend/models/ItemMaster.php

UPDATE `type_master` SET `curent_number`=8 WHERE `id`=9
---
    public function getNextCode()
   {
   $type_master=$this->type;
   $type_master->curent_number=$type_master->curent_number+1;
   $type_master->save(false);