backend/models/PaymentMasterSearch.php

SELECT `payment_master`.`date`, `booking_header`.`booking_id`, `customer_master`.`name` AS `customer_name`, `payment_master`.`type`, `payment_master`.`mode_of_payment`, `payment_master`.`received_by`, `payment_master`.`sendto`, `payment_master`.`received_during`, `payment_master`.`amount`, `booking_header`.`pickup_date`, `booking_header`.`return_date`, `booking_header`.`booking_date`, `booking_header`.`rent_amount`, `booking_header`.`deposite_amount`, `booking_header`.`return_amount`, `booking_header`.`cancellation_charges`, `booking_header`.`other_charges` FROM `payment_master` LEFT JOIN `booking_header` ON payment_master.booking_id = booking_header.booking_id LEFT JOIN `customer_master` ON booking_header.customer_id=customer_master.id WHERE (`booking_header`.`pickup_date` >= '2021-09-01') AND (`booking_header`.`pickup_date` <= '2021-09-10') AND (`type` LIKE '%Advance%' AND `type` LIKE '%Per-payment%' AND `type` LIKE '%Final-Payment%' AND `type` LIKE '%Return-Deposit%' AND `type` LIKE '%Cancel-Charge%' AND `type` LIKE '%Other-Charges%' AND `type` LIKE '%Return-Payment%') ORDER BY `pickup_date`, `booking_id`, `date`
---
public function searchSummary($params)
{
    # code...

        /*$query = PaymentMaster::find()->select(['payment_master.date','booking_header.booking_id','customer_master.name as customer_name','payment_master.type','payment_master.mode_of_payment','payment_master.received_by','payment_master.sendto','payment_master.received_during','payment_master.amount','booking_header.pickup_date','booking_header.return_date','booking_header.booking_date','booking_header.rent_amount','booking_header.deposite_amount','booking_header.return_amount','booking_header.cancellation_charges','booking_header.other_charges'])->leftJoin('booking_header','payment_master.booking_id = booking_header.booking_id')->leftJoin('customer_master','booking_header.customer_id=customer_master.id');*/
         $query = PaymentMaster::find()->select(['payment_master.date','sum(case when (`mode_of_payment` = "Cash" and (`type` = "Advance" or `type` = "Per-payment" or `type` = "Deposit" or `type` = "Final-Payment" or `type` = "Cancel-Charge")) then amount else 0 end) as cash_rec','sum(case when (`mode_of_payment` = "Cash" and (`type` = "Return-Deposit" or `type` = "Return-Payment")) then amount else 0 end) as cash_return','sum(case when ((`mode_of_payment` != "Cash" and `mode_of_payment` != "Deposit")  and (`type` = "Advance" or `type` = "Per-payment" or `type` = "Deposit" or `type` = "Final-Payment" or `type` = "Cancel-Charge")) then amount else 0 end) as online_rec','sum(case when ((`mode_of_payment` != "Cash" and `mode_of_payment` != "Deposit") and (`type` = "Return-Deposit" or `type` = "Return-Payment")) then amount else 0 end) as online_return','sum(case when ((`mode_of_payment` = "Deposit")) then amount else 0 end) as charge_on'])->groupBy(['payment_master.date']);